# LAB 04 - Data preprocessing 2

## 04 연습문제 4

- 우리는 고객들의 최근 주문 데이터 shop_order_list를 확보했습니다.
- 이 데이터를 분석하여 우리의 비즈니스에 도움이 될 핵심 인사이트를 발견하는 것이 당신의 업무입니다.

<요구사항>

온라인 쇼핑몰의 다음 분기 프로모션 전략을 수립하기 위한 분석 업무입니다.

1. 데이터 정제

데이터에 결측치가 있는지 확인하고,Price 컬럼에 있는 결측치는 전체 상품의 평균 Price로 대체해주세요.

2. 베스트셀러 카테고리 분석

Category별로 주문 건수를 계산하여 가장 많은 주문이 발생한 카테고리 상위 3개를 찾아주세요.

3. 지역별 구매력 분석

Region별 평균 Price를 계산하여 어느 지역 고객이 평균적으로 가장 비싼 상품을 구매하는지 확인해주세요. 결과는 평균 구매액이 높은 순서대로 정렬하여 보여주세요.

In [5]:
from hossam import load_data
import numpy as np
from pandas import DataFrame
from pandas import merge
from pandas import concat
from pandas import CategoricalDtype
from sklearn.impute import SimpleImputer

In [8]:
shop_order_list = load_data('shop_order_list')
shop_order_list

[data] https://data.hossam.kr/data/lab04/shop_order_list.xlsx
[desc] 온라인 쇼핑몰의 최근 고객 주문 데이터
[!] Cannot read metadata

          UserID   Product   Price     Category   Region  OrderDate
OrderID
1001     user001    Laptop  1200.0  Electronics    Seoul 2023-01-15
1002     user002     Mouse    25.0  Electronics    Busan 2023-01-16
1003     user003  Keyboard    70.0  Electronics    Seoul 2023-01-17
1004     user001      Book    15.0        Books  Incheon 2023-01-18
1005     user004   T-shirt    30.0      Apparel  Gwangju 2023-01-19
1006     user002      Book    20.0        Books    Seoul 2023-01-20
1007     user005     Jeans    80.0      Apparel    Busan 2023-02-21
1008     user001   Monitor   300.0  Electronics    Seoul 2023-02-22
1009     user006      Book    18.0        Books    Daegu 2023-02-23
1010     user007    Jacket   150.0      Apparel    Seoul 2023-02-24
1011     user003    Webcam     NaN  Electronics  Incheon 2023-03-25
1012     user008    Coffee     5.0         Food    Busan 2023-03-26
1013     user009     Snack     3.0         Food  Gwangju 2023-03-27
1014     user002    Laptop  1300.0  Electronics    Seoul 2023-03-28
1015     user010     Shoes   120.0      Apparel    Daegu 2023-03-29
1016     user005      Book    22.0        Books    Seoul 2023-04-10
1017     user001      Desk   250.0    Furniture    Busan 2023-04-11
1018     user004     Chair     NaN    Furniture    Seoul 2023-04-12
1019     user007      Book    12.0        Books  Incheon 2023-04-13
1020     user003       Hat    40.0      Apparel    Seoul 2023-04-14

In [16]:
# 1. 데이터 정제
# 데이터에 결측치가 있는지 확인하고,Price 컬럼에 있는 결측치는 전체 상품의 평균 Price로 대체해주세요.

# price 컬럼의 평균값을 구한다
shop_order_list_copy = shop_order_list.copy()
shop_order_list_mean=shop_order_list_copy['Price'].mean()


#구한 평균값을 기존 테이블에 넣어준다
col=shop_order_list_copy['Price'].fillna(shop_order_list_mean)
shop_order_list_copy['Price']=col
shop_order_list_copy

          UserID   Product        Price     Category   Region  OrderDate
OrderID
1001     user001    Laptop  1200.000000  Electronics    Seoul 2023-01-15
1002     user002     Mouse    25.000000  Electronics    Busan 2023-01-16
1003     user003  Keyboard    70.000000  Electronics    Seoul 2023-01-17
1004     user001      Book    15.000000        Books  Incheon 2023-01-18
1005     user004   T-shirt    30.000000      Apparel  Gwangju 2023-01-19
1006     user002      Book    20.000000        Books    Seoul 2023-01-20
1007     user005     Jeans    80.000000      Apparel    Busan 2023-02-21
1008     user001   Monitor   300.000000  Electronics    Seoul 2023-02-22
1009     user006      Book    18.000000        Books    Daegu 2023-02-23
1010     user007    Jacket   150.000000      Apparel    Seoul 2023-02-24
1011     user003    Webcam   203.333333  Electronics  Incheon 2023-03-25
1012     user008    Coffee     5.000000         Food    Busan 2023-03-26
1013     user009     Snack     3.000000         Food  Gwangju 2023-03-27
1014     user002    Laptop  1300.000000  Electronics    Seoul 2023-03-28
1015     user010     Shoes   120.000000      Apparel    Daegu 2023-03-29
1016     user005      Book    22.000000        Books    Seoul 2023-04-10
1017     user001      Desk   250.000000    Furniture    Busan 2023-04-11
1018     user004     Chair   203.333333    Furniture    Seoul 2023-04-12
1019     user007      Book    12.000000        Books  Incheon 2023-04-13
1020     user003       Hat    40.000000      Apparel    Seoul 2023-04-14

In [24]:
# 2. 베스트셀러 카테고리 분석

# Category별로 주문 건수를 계산하여 가장 많은 주문이 발생한 카테고리 상위 3개를 찾아주세요.

#구하려는 데이터 컬럼만 필터링 작업
shop_order_list_copy2=shop_order_list_copy.copy()

category_top3 = shop_order_list_copy2.filter(['Category','UserID'])
category_top3

            Category   UserID
OrderID
1001     Electronics  user001
1002     Electronics  user002
1003     Electronics  user003
1004           Books  user001
1005         Apparel  user004
1006           Books  user002
1007         Apparel  user005
1008     Electronics  user001
1009           Books  user006
1010         Apparel  user007
1011     Electronics  user003
1012            Food  user008
1013            Food  user009
1014     Electronics  user002
1015         Apparel  user010
1016           Books  user005
1017       Furniture  user001
1018       Furniture  user004
1019           Books  user007
1020         Apparel  user003

In [27]:
a=category_top3.groupby('Category').count()
a.sort_values('UserID',ascending=False).head(3)

             UserID
Category
Electronics       6
Apparel           5
Books             5

In [29]:
# 3. 지역별 구매력 분석

# Region별 평균 Price를 계산하여 어느 지역 고객이 평균적으로 가장 비싼 상품을 구매하는지 확인해주세요. 결과는 평균 구매액이 높은 순서대로 정렬하여 보여주세요.

#Region별 평균 Price

region_mean_sorted = shop_order_list_copy2.filter(['Region','Price'])
region_mean_sorted

          Region        Price
OrderID
1001       Seoul  1200.000000
1002       Busan    25.000000
1003       Seoul    70.000000
1004     Incheon    15.000000
1005     Gwangju    30.000000
1006       Seoul    20.000000
1007       Busan    80.000000
1008       Seoul   300.000000
1009       Daegu    18.000000
1010       Seoul   150.000000
1011     Incheon   203.333333
1012       Busan     5.000000
1013     Gwangju     3.000000
1014       Seoul  1300.000000
1015       Daegu   120.000000
1016       Seoul    22.000000
1017       Busan   250.000000
1018       Seoul   203.333333
1019     Incheon    12.000000
1020       Seoul    40.000000

In [33]:
avg_price=region_mean_sorted.groupby('Region').mean()
avg_price.sort_values('Price',ascending=False)

              Price
Region
Seoul    367.259259
Busan     90.000000
Incheon   76.777778
Daegu     69.000000
Gwangju   16.500000